4. WS Security - Authentication/provider/src/main/resources/soapRequest.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                       soap:mustUnderstand="1">
            <wsse:UsernameToken wsu:Id="UsernameToken-e6ed5576-d7da-43f3-a37a-6ec40ffb5411">
                <wsse:Username>sum-username</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    sum-password
                </wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <ns2:calculateSum xmlns:ns2="http://services.ws.courses.academicprogrammer.com/">
            <CalculateSumRequest>
                <x>15</x>
                <y>25</y>
            </CalculateSumRequest>
        </ns2:calculateSum>
    </soap:Body>
</soap:Envelope>